app/controllers/urls_controller.rb

SELECT `urls`.* FROM `urls`
---
  def index
    @urls = Url.all

SELECT `urls`.* FROM `urls` WHERE `urls`.`shorturl` = 'ckzo3lhh' LIMIT 1
---
  def show_url
    @link = Url.find_by_shorturl(params[:shorturl])

INSERT INTO `urls` (`longurl`, `shorturl`, `created_at`, `updated_at`) VALUES ('https://www.youtube.com/watch?v=e7aMkLOhm7s', 'zuk5qqk9', '2022-04-26 18:55:16.925038', '2022-04-26 18:55:16.925038')
---
  def addurl
    long_url = params['longurl']
    short_url = rand(36**8).to_s(36)
    @url = Url.new()
    @url.longurl =long_url
    @url.shorturl = short_url
    if @url.save

DELETE FROM `urls` WHERE `urls`.`id` = 4
---
  def destroy
    @url.destroy

SELECT `urls`.* FROM `urls` WHERE `urls`.`id` = 4 LIMIT 1
---
    def set_url
      @url = Url.find(params[:id])