app/controllers/urls_controller.rb

  def create
    @url = Url.new(url_params)

    respond_to do |format|
      if @url.save
---
INSERT INTO `urls` (`longurl`, `created_at`, `updated_at`) VALUES ('https://www.youtube.com/watch?v=OsU0CGZoV8E', '2022-04-26 09:05:15.259677', '2022-04-26 09:05:15.259677')

    def set_url
      @url = Url.find(params[:id])
---
SELECT `urls`.* FROM `urls` WHERE `urls`.`id` = 1 LIMIT 1